#カテゴリー

def categorize(level_parent, level_children, level_grandchildren)
  level_children.each_with_index do |level_child, i|
    level_child = level_parent.children.create(name: level_child)
    level_grandchildren[i].each do |level_grandchild|
      level_child.children.create(name: level_grandchild)
    end
  end
end



level_children = ["トップス","ジャケット/アウター","パンツ","スカート","ワンピース","靴","ルームウェア/パジャマ","レッグウェア","帽子","バッグ","アクセサリー","ヘアアクセサリー","小物","時計","ウィッグ/エクステ","浴衣/水着","スーツ/フォーマル/ドレス","マタニティ","その他"]
level_grandchildren = [["Tシャツ/カットソー(半袖/袖なし）","Tシャツ/カットソー(七部/長袖）","シャツ/ブラウス(半袖/袖なし)","シャツ/ブラウス(七分/長袖)","ポロシャツ","キャミソール","タンクトップ","ホルターネック","ニット/セーター","チュニック","カーディガン/ボレロ","アンサンブル","ベスト/ジレ","パーカー","トレーナー/スウェット","ベアトップ/チューブトップ","ジャージ","その他"],
                       ["テーラードジャケット","ノーカラージャケット","Gジャン/デニムジャケット","レザージャケット","ダウンジャケット","ライダースジャケット","ミリタリージャケット","ダウンベスト","ジャンパー/ブルゾン","ポンチョ","ロングコート","トレンチコート","ダッフルコート","ピーコート"],
                       ["デニム/ジーンズ","ショートパンツ","カジュアルパンツ","ハーフパンツ","チノパン","ワークパンツ/カーゴパンツ","クロップドパンツ","サロペット/オーバーオール","オールインワン","サルエルパンツ","ガウチョパンツ","その他"],
                       ["ミニスカート","ひざ丈スカート","ロングスカート","キュロット","その他"],
                       ["ミニワンピース","ひざ丈ワンピース","ロングワンピース","その他"],
                       ["ハイヒール/パンプス","ブーツ","サンダル","スニーカー","ミュール","モカシン","ローファー/革靴","フラットシューズ/バレエシューズ","長靴/レインシューズ","その他"],
                       ["パジャマ","ルームウェア"],
                       ["ソックス","スパッツ/レギンス","ストッキング/タイツ","レッグウォーマー","その他"],
                       ["ニットキャップ/ビーニー","ハット","ハンチング/ベレー帽","キャップ","キャスケット","麦わら帽子","その他"],
                       ["ハンドバッグ","トートバッグ","エコバッグ","リュック/バックパック","ボストンバッグ","スポーツバッグ","ショルダーバッグ","クラッチバッグ","ポーチ/バニティ","ボディバッグ/ウェストバッグ","マザーズバッグ","メッセンジャーバッグ","ビジネスバッグ","旅行用バッグ/キャリーバッグ"],
                       ["ネックレス","ブレスレット","バングル/リストバンド","リング","ピアス(片耳用)","ピアス(両耳用)","イヤリング","アンクレット","ブローチ/コサージュ","チャーム","その他"],
                       ["ヘアゴム/シュシュ","ヘアバンド/カチューシャ","ヘアピン","その他"],
                       ["長財布","折り財布","コインケース/小銭入れ","名刺入れ/定期入れ","キーケース","キーホルダー","手袋/アームカバー","ハンカチ","ベルト","マフラー/ショール","ストール/スヌード","バンダナ/スカーフ","ネックウォーマー","サスペンダー"],
                       ["腕時計(アナログ)","腕時計(デジタル)","ラバーベルト","レザーベルト","金属ベルト","その他"],
                       ["前髪ウィッグ","ロングストレート","ロングカール","ショートストレート","ショートカール","その他"],
                       ["浴衣","着物","振袖","長襦袢/半襦袢","水着セパレート","水着ワンピース","水着スポーツ用","その他"],
                       ["スカートスーツ上下","パンツスーツ上下","ドレス","パーティーバッグ","シューズ","その他"],
                       ["トップス","アウター","インナー","ワンピース","パンツ/スパッツ","スカート","パジャマ","授乳服","その他"],
                       ["コスプレ","下着","その他"]
]
level_parent = Category.create(name: "レディース")
categorize(level_parent ,level_children, level_grandchildren)




level_children = ["トップス","ジャケット/アウター","パンツ","靴","バッグ","スーツ","帽子","アクセサリー","小物","時計","水着","レッグウェア","アンダーウェア","その他"]
level_grandchildren = [["Tシャツ/カットソー(半袖/袖なし)","Tシャツ/カットソー(七分/長袖)","シャツ","ポロシャツ","タンクトップ","ニット/セーター","パーカー","カーディガン","スウェット","ジャージ","ベスト","その他"],
                       ["テーラードジャケット","ノーカラージャケット","Gジャン/デニムジャケット","レザージャケット","ダウンジャケット","ライダースジャケット","ミリタリージャケット","ナイロンジャケット","フライトジャケット","ダッフルコート","ピーコート","ステンカラーコート","トレンチコート","モッズコート"],
                       ["デニム/ジーンズ","ワークパンツ/カーゴパンツ","スラックス","チノパン","ショートパンツ","ペインターパンツ","サルエルパンツ","オーバーオール","その他"],
                       ["スニーカー","サンダル","ブーツ","モカシン","ドレス/ビジネス","長靴/レインシューズ","デッキシューズ","その他"],
                       ["ショルダーバッグ","トートバッグ","ボストンバッグ","リュック/バックパック","ウエストポーチ","ボディーバッグ","ドラムバッグ","ビジネスバッグ","トラベルバッグ","メッセンジャーバッグ","エコバッグ","その他"],
                       ["スーツジャケット","スーツベスト","スラックス","セットアップ","その他"],
                       ["キャップ","ハット","ニットキャップ/ビーニー","ハンチング/ベレー帽","キャスケット","サンバイザー","その他"],
                       ["ネックレス","ブレスレット","バングル/リストバンド","リング","ピアス(片耳用)","ピアス(両耳用)","アンクレット","その他"],
                       ["長財布","折り財布","マネークリップ","コインケース/小銭入れ","名刺入れ/定期入れ","キーケース","キーホルダー","ネクタイ","手袋","ハンカチ","ベルト","マフラー","ストール","バンダナ"],
                       ["腕時計(アナログ)","腕時計(デジタル)","ラバーベルト","レザーベルト","金属ベルト","その他"],
                       ["一般水着","スポーツ用","アクセサリー","その他"],
                       ["ソックス","レギンス/スパッツ","レッグウォーマー","その他"],
                       ["トランクス","ボクサーパンツ","その他"],
                       [""]
]
level_parent = Category.create(name: "メンズ")
categorize(level_parent ,level_children, level_grandchildren)



level_children = ["ベビー服(女の子用) ~95cm","ベビー服(男の子用) ~95cm","ベビー服(男女兼用) ~95cm","キッズ服(女の子用) 100cm~","キッズ服(男の子用) 100cm~","キッズ服(男女兼用) 100cm~","キッズ靴","子ども用ファッション小物","おむつ/トイレ/バス","外出/移動用品","授乳/食事","ベビー家具/寝具/室内用品","おもちゃ","行事/記念品"]
level_grandchildren = [["トップス","アウター","パンツ","スカート","ワンピース","ベビードレス","おくるみ","下着/肌着","パジャマ","ロンパース","その他"],
                       ["トップス","アウター","パンツ","おくるみ","下着/肌着","パジャマ","ロンパース","その他"],
                       [ "トップス","アウター","パンツ","おくるみ","下着/肌着","パジャマ","ロンパース","その他"],
                       ["コート","ジャケット/上着","トップス(Tシャツ/カットソー)","トップス(トレーナー)","トップス(チュニック)","トップス(タンクトップ)","トップス(その他)","スカート","パンツ","ワンピース","セットアップ","パジャマ","フォーマル/ドレス","和服"],
                       ["コート","ジャケット/上着","トップス(Tシャツ/カットソー)","トップス(トレーナー)","トップス(その他)","パンツ","セットアップ","パジャマ","フォーマル/ドレス","和服","浴衣","甚平","水着","その他"],
                       ["コート","ジャケット/上着","トップス(Tシャツ/カットソー)","トップス(トレーナー)","トップス(その他)","ボトムス","パジャマ","その他"],
                       ["スニーカー","サンダル","ブーツ","長靴","その他"],
                       ["靴下/スパッツ","帽子","エプロン","サスペンダー","タイツ","ハンカチ","バンダナ","ベルト","マフラー","傘","手袋","スタイ","バッグ","その他"],
                       ["おむつ用品","おまる/補助便座","トレーニングパンツ","ベビーバス","お風呂用品","その他"],
                       ["ベビーカー","抱っこひも/スリング","チャイルドシート","その他"],
                       ["ミルク","ベビーフード","ベビー用食器","その他"],
                       ["ベッド","布団/毛布","イス","たんす","その他"],
                       ["おふろのおもちゃ","がらがら","オルゴール","ベビージム","手押し車/カタカタ","知育玩具","その他"],
                       ["お宮参り用品", "お食い初め用品","アルバム","手形/足形","その他"]                       
]
level_parent = Category.create(name: "ベビー・キッズ")
categorize(level_parent ,level_children, level_grandchildren)




level_children = ["キッチン/食器","ベッド/マットレス","ソファ/ソファベッド","椅子/チェア","机/テーブル","収納家具","ラグ/カーペット/マット","カーテン/ブラインド","ライト/照明","寝具","インテリア小物","季節/年中行事","その他"]
level_grandchildren = [["食器","調理器具","収納/キッチン雑貨","弁当用品","カトラリー(スプーン等)","テーブル用品","容器","エプロン","アルコールグッズ","浄水機","その他"],
                       ["セミシングルベッド","シングルベッド","セミダブルベッド","ダブルベッド","ワイドダブルベッド","クイーンベッド","キングベッド","脚付きマットレスベッド","マットレス","すのこベッド","ロフトベッド/システムベッド","簡易ベッド/折りたたみベッド","収納付き","その他"],
                       ["ソファセット","シングルソファ","ラブソファ","トリプルソファ","オットマン","コーナーソファ","ビーズソファ/クッションソファ","ローソファ/フロアソファ","ソファベッド","応接セット","ソファカバー","リクライニングソファ","その他"],
                       ["一般","スツール","ダイニングチェア","ハイバックチェア","ロッキングチェア","座椅子","折り畳みイス","デスクチェア","その他"],
                       ["こたつ","カウンターテーブル","サイドテーブル","センターテーブル","ダイニングテーブル","座卓/ちゃぶ台","アウトドア用","パソコン用","事務机/学習机","その他"],
                       ["リビング収納","キッチン収納","玄関/屋外収納","バス/トイレ収納","本収納","本/CD/DVD収納","洋服タンス/押入れ収納","電話台/ファックス台","ドレッサー/鏡台","棚/ラック","ケース/ボックス","その他"],
                       ["ラグ","カーペット","ホットカーペット","玄関/キッチンマット","トイレ/バスマット","その他"],
                       ["カーテン","ブラインド","ロールスクリーン","のれん","その他"],
                       ["蛍光灯/電球","天井照明","フロアスタンド","その他"],
                       ["布団/毛布","枕","シーツ/カバー","その他"],
                       ["ごみ箱","ウェルカムボード","その他"],
                       ["正月","成人式","その他"],
                       [""]
]
level_parent = Category.create(name: "インテリア・住まい・小物")
categorize(level_parent ,level_children, level_grandchildren)




level_children = ["本","漫画","雑誌","CD","DVD/ブルーレイ","レコード","テレビゲーム"]
level_grandchildren = [["文学/小説","文学/小説","ノンフィクション/教養"],
                       ["全巻セット","少年漫画","少女漫画"],
                       ["アート/エンタメ/ホビー","ファッション","ニュース/総合"],
                       ["邦楽","洋楽","アニメ"],
                       ["外国映画", "日本映画", "アニメ"],
                       ["邦楽","洋楽","その他"],
                       ["家庭用ゲーム本体","家庭用ゲームソフト","携帯用ゲーム本体"]
]
level_parent = Category.create(name: "本・音楽・ゲーム")
categorize(level_parent ,level_children, level_grandchildren)




level_children = ["おもちゃ","タレントグッズ","コミック/アニメグッズ","トレーディングカード","フィギュア","楽器/器材","コレクション","ミリタリー","美術品","アート用品","その他"]
level_grandchildren = [["キャラクターグッズ","ぬいぐるみ","小物/アクセサリー"],
                       ["アイドル","ミュージシャン","タレント/お笑い芸人"],
                       ["ストラップ","キーホルダー","バッジ"],
                       ["遊戯王","マジック：ザ・ギャザリング","ポケモンカードゲーム"],
                       ["コミック/アニメ","特撮","ゲームキャラクター"],
                       ["エレキギター","アコースティックギター","ベース"],
                       ["武具","使用済切手/官製はがき","旧貨幣/金貨/銀貨/記念硬貨"],
                       ["トイガン","個人装備","その他"],
                       ["陶芸","ガラス","漆芸"],
                       ["画材","額縁","その他"],
                       ["トランプ/UNO","カルタ/百人一首","ダーツ"]
]
level_parent = Category.create(name: "おもちゃ・ホビー・グッズ")
categorize(level_parent ,level_children, level_grandchildren)




level_children = ["ベースメイク","メイクアップ","ネイルケア","香水","スキンケア/基礎化粧品","ヘアケア","ボディケア","オーラルケア","リラクゼーション","ダイエット","その他"]
level_grandchildren = [["ファンデーション","化粧下地","コントロールカラー"],
                       ["アイシャドウ","口紅","リップグロス"],
                       ["ネイルカラー","カラージェル","ネイルベースコート/トップコート"],
                       ["香水(女性用)","香水(男性用)","ユニセックス"],
                       ["化粧水/ローション","乳液/ミルク","美容液"],
                       ["シャンプー","トリートメント","コンディショナー"],
                       ["オイル/クリーム","ハンドクリーム","ローション"],
                       ["口臭防止/エチケット用品","歯ブラシ","その他"],
                       ["エッセンシャルオイル","芳香器","お香/香炉"],
                       ["ダイエット食品","エクササイズ用品","体重計"],
                       ["健康用品","看護/介護用品","救急/衛生用品"]
]
level_parent = Category.create(name: "コスメ・香水・美容")
categorize(level_parent, level_children, level_grandchildren)




level_children = ["スマートフォン/携帯電話","スマホアクセサリー","PC/タブレット","カメラ","テレビ/映像機器","オーディオ機器","美容/健康","冷暖房/空調","生活家電","その他"]
level_grandchildren = [["スマートフォン本体","バッテリー/充電器","携帯電話本体"],
                       ["Android用ケース","iPhone用ケース","カバー"],
                       ["タブレット","ノートPC","デスクトップ型PC"],
                       ["デジタルカメラ","ビデオカメラ","レンズ(単焦点)"],
                       ["テレビ","プロジェクター","ブルーレイレコーダー"],
                       ["ポータブルプレーヤー","イヤフォン","ヘッドフォン"],
                       ["ヘアドライヤー","ヘアアイロン","美容機器"],
                       ["エアコン","空気清浄器","加湿器"],
                       ["冷蔵庫","洗濯機","炊飯器"],
                       ["その他"]
]
level_parent = Category.create(name: "家電・スマホ・カメラ")
categorize(level_parent, level_children, level_grandchildren)




level_children = ["ゴルフ","フィッシング","自転車","トレーニング/エクササイズ","野球","サッカー/フットサル","テニス","スノーボード","スキー","その他スポーツ","アウトドア","その他"]
level_grandchildren = [["クラブ","ウエア(男性用)","ウエア(女性用)"],
                       ["ロッド","リール","ルアー用品"],
                       ["自転車本体","ウエア","パーツ"],
                       ["ランニング","ウォーキング","ヨガ"],
                       ["ウェア","シューズ","グローブ"],
                       ["ウェア","シューズ","ボール"],
                       ["ラケット(硬式用)","ラケット(軟式用)","ウェア"],
                       ["ボード","バインディング","ブーツ(男性用)"],
                       ["板","ブーツ(男性用)","ブーツ(女性用)"],
                       ["ダンス/バレエ","サーフィン","バスケットボール"],
                       ["テント/タープ","ライト/ランタン","寝袋/寝具"],
                       ["旅行用品","その他"]

]
level_parent = Category.create(name: "スポーツ・レジャー")
categorize(level_parent, level_children, level_grandchildren)




level_children = ["アクセサリー(女性用)","ファッション/小物","アクセサリー/時計","日用品/インテリア","趣味/おもちゃ","キッズ/ベビー","素材/材料","二次創作物","その他"]
level_grandchildren = [["ピアス","イヤリング","ネックレス"],
                       ["バッグ(女性用)","バッグ(男性用)","財布(女性用)"],
                       ["アクセサリー(男性用)","時計(女性用)","時計(男性用)"],
                       ["キッチン用品","家具","文房具"],
                       ["クラフト/布製品","おもちゃ/人形","その他"],
                       ["ファッション雑貨","スタイ/よだれかけ","外出用品"],
                       ["各種パーツ","生地/糸","型紙/パターン"],
                       ["Ingress","クリエイターズ宇宙兄弟"],
                       [""]
]
level_parent = Category.create(name: "ハンドメイド")
categorize(level_parent, level_children, level_grandchildren)





level_children = ["音楽","スポーツ","演劇/芸能","イベント","映画","施設利用券","優待券/割引券","その他"]
level_grandchildren = [["男性アイドル","女性アイドル","韓流"],
                       ["サッカー","野球","テニス"],
                       ["ミュージカル","演劇","伝統芸能"],
                       ["声優/アニメ","キッズ/ファミリー","トークショー/講演会"],
                       ["邦画","洋画","その他"],
                       ["遊園地/テーマパーク","美術館/博物館","スキー場"],
                       ["ショッピング","レストラン/食事券","フード/ドリンク券"],
                       [""]
]
level_parent = Category.create(name: "チケット")
categorize(level_parent, level_children, level_grandchildren)





level_children = ["自動車本体","自動車タイヤ/ホイール","自動車パーツ","自動車アクセサリー","オートバイ車体","オートバイパーツ","オートバイアクセサリー"]
level_grandchildren = [["国内自動車本体","外国自動車本体"],
                       ["タイヤ/ホイールセット","タイヤ","ホイール"],
                       ["サスペンション","ブレーキ","外装、エアロパーツ"],
                       ["車内アクセサリー","カーナビ","カーオーディオ"],
                       [""],
                       ["タイヤ","マフラー","エンジン、冷却装置"],
                       ["ヘルメット/シールド","バイクウエア/装備","アクセサリー"]
]
level_parent = Category.create(name: "自動車・オートバイ")
categorize(level_parent, level_children, level_grandchildren)





level_children = ["まとめ売り","ペット用品","食品","飲料/酒","日用品/生活雑貨/旅行","アンティーク/コレクション","文房具/事務用品","事務/店舗用品"]
level_grandchildren = [[""],
                       ["ペットフード","犬用品","猫用品"],
                       ["菓子","米","野菜"],
                       ["コーヒー","ソフトドリンク","ミネラルウォーター"],
                       ["タオル/バス用品","日用品/生活雑貨","洗剤/柔軟剤"],
                       ["雑貨","工芸品","家具"],
                       ["筆記具","ノート/メモ帳","テープ/マスキングテープ"],
                       ["オフィス用品一般","オフィス家具","店舗用品"]
]
level_parent = Category.create(name: "その他")
categorize(level_parent, level_children, level_grandchildren)